{
  "projects": [
    {
      "name": "Event Tracker",
      "teaser": "Find and buy tickets for upcoming events from your favorite performers.",
      "description": "This site allowed a user to search upcoming events for any sports team or musical artist. Users were shown the performer’s next 10 upcoming events, time and location, number of available tickets to buy, lowest available price, and a direct link to buy tickets.",
      "image": "/public/images/eventThumb.jpg",
      "github": "https://github.com/louisrowan/event-tracker",
      "learned": "This was my first exposure to using both an API and JSON, as well as using JQuery on the front-end to create a dynamic website. This was also my introduction to design and making a site look nice.",
      "technologies": [
        "Ruby", "Sinatra", "JQuery", "SQL"
      ]
    },
    {
      "name": "Mathio Party",
      "teaser": "Multiplayer math games that track your data.",
      "image": "/public/images/mathioThumb.jpg",
      "description": "This week-long group project at Dev Bootcamp was a game suite with 4 math games that tracked data and used data visualization to show a user’s strengths and weaknesses. The games are all multi-player and data tracking is specific enough to pinpoint which areas need improvement.",
      "heroku": "http://mathio-party.herokuapp.com/",
      "github": "https://github.com/kaydenwilliams7/mathio-party",
      "learned": "This was a week-long group project that I put at least 80 hours into, so I learned a great deal about group version control and using an agile workflow. This was also my introduction to data collection and visualization, and technologies such as D3, highcharts and Phaser.",
      "technologies": [
        "D3", "Rails", "Ruby", "JQuery", "Phaser", "Git"
      ]
    },
    {
      "name": "Rainy Day Science",
      "teaser": "Conduct Science experiments from common household items.",
      "description": "Award winning project at the 2016 San Francisco Science Hack Day, this was a decoupled Rails/React app that supplied a list of household items for a user to check. Users were then given a list of Science Experiments that could be conducted with the items they have, and given directions and an instructional video to conduct the experiment.",
      "image": "/public/images/scienceThumb.jpg",
      "github": "https://github.com/louisrowan/science-hack-react",
      "heroku": "http://rainy-day-science.herokuapp.com/#/",
      "learned": "This was my first experience working on a decoupled app, as well as my first time attempting to manipulate the DOM in React without using JQuery. Since the target user of the site is a child we also made sure to make the UI very user-friendly and easy to use, which was another new concept.",
      "technologies": [
        "React", "Rails", "Git", "Node/Webpack"
      ]
    },
    {
      "name": "Warnnt",
      "teaser": "First-place Hackathon Project promoting community accountability.",
      "description": "This project won first place at the 2016 SF Hack Against Violence, and featured an easy-to-use email form that dynamically edited the recipients based on a user’s needs. Users were given a list of possible community issues they were experiencing, such as excessive force or reckless driving by police. The idea was to create an easy way to hold police accountable and a venue for people to easily contact the appropriate party.",
      "github": "https://github.com/samuelparker/warrnt",
      "learned": "This group project was completed a week after first being exposed to Sinatra and web development, so it introduced an array of foreign concepts such as design, using JQuery, creating and email form as well as simply integrating a database into a project. ",
      "image": "/public/images/warnntThumb.jpg",
      "technologies": [
        "Sinatra", "Ruby", "JQuery", "Git"
      ]
    },
    {
      "name": "College Football Recruiting",
      "teaser": "Data Viz app to display college football recruiting data.",
      "description": "This Rails app parsed the web using Nokogiri for 10 years of college football recruiting data, and then displayed it using the Highcharts.JS library. Users can view year data from 2004-present, or school data from any school that have recruited Rivals250 recruits.",
      "github": "https://github.com/louisrowan/collegeFootball",
      "heroku": "http://collegefootballrecruiting.herokuapp.com/",
      "learned": "This was a deep dive into data visualization for me, and learning how to create responsive displays that could accommodate a changing dataset. I also used this as a chance to use Nokogiri and feel more comfortable parsing the web and navigating the DOM to find the correct information.",
      "image": "/public/images/collegeThumb.jpg",
      "technologies": [
        "Ruby", "Rails", "Highcharts", "SQL", "Nokogiri"
      ]
    },
    {
      "name": "Skyscrapers",
      "teaser": "Project to teach myself D3.",
      "description": "This app is still a work in progress, uses D3 to showcase the world's tallest skyscrapers and to compare their heights both with each other and with other tall things.",
      "learned": "This app was my attempt to teach myself the basics of D3 such as bubble charts, donut charts, force layouts, working with SVGs and dealing with changing datasets.",
      "heroku": "http://skyscraper-d3.herokuapp.com/",
      "image": "/public/images/skyscraperThumb.jpg",
      "technologies": [
        "D3", "React", "Rails"
      ]
    }
  ],
  "images": {
    "linkedin": "/public/images/linkedin.png",
    "github": "/public/images/github.png",
    "heroku": "/public/images/heroku.png",
    "me": "/public/images/me.jpg",
    "background": "/public/images/background.jpg",
    "blogNav": "/public/images/blogNav.gif"
  },
  "skills": [
    {
      "name": "React",
      "type": "front",
      "image": "/public/images/react.png"
    },
    {
      "name": "Rails",
      "type": "back",
      "image": "/public/images/rails.png"
    },
    {
      "name": "JavaScript",
      "type": "front",
      "image": "/public/images/javascript.jpg"
    },
    {
      "name": "Redux",
      "type": "front",
      "image": "/public/images/redux.png"
    },
    {
      "name": "D3",
      "type": "front",
      "image": "/public/images/d3.png"
    },
    {
      "name": "Git/Github",
      "type": "other",
      "image": "/public/images/github.png"
    },
    {
      "name": "Node/Webpack",
      "type": "back",
      "image": "/public/images/node.jpg"
    },
    {
      "name": "C/C++",
      "type": "back",
      "image": "/public/images/c.jpg"
    },
    {
      "name": "SQL",
      "type": "back",
      "image": "/public/images/sql.png"
    },
    {
      "name": "Python",
      "type": "back",
      "image": "/public/images/python.png"
    },
    {
      "name": "Ruby",
      "type": "back",
      "image": "/public/images/ruby.png"
    }

  ]
}